[
    {
        "@context": "http://schema.org/",
        "@type": "JobPosting",
        "title": "Senior ICT Services Manager - m/f",
        "description": "<p></p><p>The Senior ICT Services Manager will be responsible for establishing, and managing, a smooth and efficient ICT operation within a rapidly expanding organization. Change management will be a key part of the role, from the perspectives of technology, processes, people and culture. </p><p></p><h2>Senior ICT Services Manager - m/f</h2><p></p><p>ECA is the sole independent body directly representing football clubs at European level. With a current membership base of more than 490 professional football clubs from across the continent, with plans to increase to 700 Members in the years ahead, ECA is the representative voice of European clubs on the international football landscape.</p> <p>  </p> <p>Working closely with football's governing bodies, competition organizers, and other professional stakeholders, ECA's core purpose is to place clubs at the 'Heart of Football'. ECA is continually strengthening its administration to ensure it enhances the value of its activities and services for Member clubs.</p> <p>  </p> <p>ECA has a rapidly growing administration team of more than 40 people, with further headcount increases planned, and is on a mission of organizational development, targeting digitally-led, performance-driven culture, and delivering high impact outcomes for our colleagues, and our members.</p> <p>  </p> <p>Equity, diversity, and inclusion are amongst ECA's core values, and we are committed to building and sustaining an inclusive and equitable working and learning environment, for all staff and members. </p> <p> <strong>Description</strong> </p> <p>The Senior ICT Services Manager will be responsible for establishing, and managing, a smooth and efficient ICT operation within a rapidly expanding organization. Change management will be a key part of the role, from the perspectives of technology, processes, people and culture. The ideal candidate must be a proactive, innovative, and solution-oriented individual, with a successful background in ICT transformation and management, particularly in Office 365. </p> <p>In addition to technical expertise, he/she must possess a capacity to drive and manage digital change within a developing organization to:</p> <ul> <li>Increase productivity and efficiency</li> <li>Improve decision making</li> <li>Promote innovation and agility</li> <li>Improve data security and compliance</li> <li>Enhance stakeholder experience; and</li> <li>Develop collaboration and communication</li> </ul> <p>The successful individual must be skilled not only in understanding and implementing new technologies, but in leading change management processes to ensure smooth transitions, and widespread acceptance, of new systems and digital practices.</p> <p>The ability to effectively communicate with a wide range of stakeholders, and to build consensus around new initiatives, is crucial.</p> <p>The role is based at ECA's offices in Nyon, Switzerland. Some travel within, and outside of, Switzerland may be required from time to time.</p> <p>  </p> <p>CORE RESPONSIBILITIES</p> <p>  </p> <p>Reporting to the Membership Project Leader, who is an experienced IT professional, the Senior ICT Services Manager will be responsible for:</p> <p>* Developing, executing, and owning the organisation's ICT strategy.</p> <p>* Architecting and maintaining digital systems, with a focus on optimization and rationalization of Office 365-based infrastructure. </p> <p>* Working closely with departmental leads to identify efficiency improvement opportunities via the deployment of cost-effective digital solutions. </p> <p>* Continually reviewing, auditing and improving the organisation's ICT infrastructure. </p> <p>* Owning all ICT tender processes, culminating in the selection of high quality and cost-effective digital solutions and in implementing these with minimal business disruption. </p> <p>* Designing and implementing a robust cybersecurity strategy for ECA and by extension its members (as a service).</p> <p>* Managing the procurement process for all ICT hardware and software. </p> <p>* Delivering a first-class service and high-quality support to all users internally and within ECA's membership.</p> <p>* Effective management of all ICT service providers and ensure high-quality service delivery in accordance with all service agreements.</p> <p>* Owning &amp; driving all ICT projects from initial concept stage through to successful implementation.</p> <p>* Ensuring full compliance with all ICT related regulations and implement industry best practice.</p> <p>* Horizon scanning to identify future efficiency opportunities.</p> <p>* Managing and developing ECA's ICT Officer (direct report to this role). </p> <p> <strong>Profile</strong> </p> <p>EXPERIENCE</p> <p>* Minimum of 5-7 years' experience managing ICT operations.</p> <p>* Experience of managing a team and successfully leading an ICT function.</p> <p>* Proven experience with Office 365 architecture, management and optimization.</p> <p>* Demonstrable track-record of successfully delivering ICT solutions in a fast-growing organization.</p> <p>* Multiple successful experiences of leading vendor selection and service delivery management.</p> <p>  </p> <p>EDUCATION </p> <p>* Bachelor's degree in ICT, Computer Science or related field (Masters' degree is advantageous).</p> <p>* Relevant professional certifications in ICT management, especially Office 365, and project management.</p> <p>* Language skills: Fluent in both English and French (additional languages are advantageous).</p> <p>  </p> <p>SKILLS</p> <p>* Strong technical and architectural knowledge of ICT systems, particularly Office 365.</p> <p>* Exceptional change management skills, with a proven ability to lead and manage cultural shifts within an organization embarking on a digital transformation journey. </p> <p>* Excellent and proven project management skills, with a track-record of successfully delivering ICT projects.</p> <p>* Strong analytical and problem-solving skills, with an ability to foresee potential issues and risks, and to proactively identify and develop solutions.</p> <p>* Excellent people skills, with the ability to cultivate and maintain strong working relationships with colleagues and external providers.</p> <p>* Outstanding communication skills, both verbal and written, with the ability to convey technical information in a concise and understandable way to non-technical colleagues and stakeholders.</p> <p>* Highly organized with strong attention to detail.</p> <p>* Self-motivated, able to work autonomously and as part of a team.</p> <p>* Strong understanding of data privacy and security protocols.</p> <p>* Comfortable in managing simultaneous projects and in working to tight deadlines. </p> <p> <strong>Job Offer</strong> </p> <p>Candidates should send their applications to Michael Page Company who assists ECA with the recruitment process. Please email your CV and covering letter to : </p> <p>Only candidates fulfilling the required skills and experience will be contacted. </p><p></p><p></p>",
        "datePosted": "2024-02-12T10:19:11+01:00",
        "validThrough": "2024-02-14",
        "hiringOrganization": {
            "@type": "Organization",
            "name": "Michael Page",
            "sameAs": "http://Michaelpage.ch",
            "address": {
                "addressLocality": "Genève"
            },
            "logo": "https://media.jobup.ch/media/94a430bb-437e-4263-957b-ff6cf7dacf65.jpg"
        },
        "identifier": {
            "@type": "PropertyValue",
            "name": "Michael Page Switzerland",
            "value": "348ec7b4-ec55-4139-b1fd-76f801e0da33"
        },
        "jobLocation": {
            "@type": "Place",
            "address": {
                "@type": "PostalAddress",
                "streetAddress": "Nyon",
                "addressLocality": "Nyon",
                "postalCode": "1260",
                "addressCountry": "Switzerland"
            }
        },
        "industry": "Associations / Organisations",
        "employmentType": [
            "FULL_TIME"
        ],
        "occupationalCategory": "Technicien système / Administration système"
    }
]